[
  {
    "date": "2023-11",
    "title": "service",
    "description": "I Will present on the NeurIPS 2023 Conference Workdshop on Mathemathics of Modern Machine Learning."
  },
  {
    "date": "2023-07",
    "title": "service",
    "description": "Will service as a reviewer for the NeurIPS 2023 Conference."
  },
  {
    "date": "2023-06",
    "title": "school",
    "description": "I was selected to attend to the 2023 edition of the <a href='https://probabilistic.ai/#about'>Nordic Probabilistic AI School (ProbAI)</a> being hosted by the <a href='https://www.ntnu.edu/'>Norwegian University of Science and Technology (NTNU)</a> and sponsored by <a href='http://deepmind.com/'>DeepMind</a>."
  },
  {
    "date": "2023-05",
    "title": "software",
    "description": "Together with colleagues, released <a href='https://github.com/edadaltocg/detectors'>detectors</a>: open-source library for out-of-distribution detection on computer vision applications."
  },
  {
    "date": "2023-01",
    "title": "software",
    "description": "Together with colleagues, released <a href='https://github.com/icannos/Todd'>Todd</a>: open-source library for text out-of-distribution detection built on top of the Huggingface Transformers library."
  },
  {
    "date": "2022-09",
    "title": "paper",
    "description": "Our work entitled “Beyond Mahalanobis Distance for Textual OOD Detection” has been accepted to appear in the NeurIPS 2022 Conference."
  },
  {
    "date": "2022-12",
    "title": "service",
    "description": "Will service as a reviewer for the CVPR 2023 Conference."
  },
  {
    "date": "2022-04",
    "title": "talk",
    "description": "Gave a talk at a poster session of the NeurIPS 2022 Conference."
  },
  {
    "date": "2022-11",
    "title": "service",
    "description": "Will attend the NeurIPS 2022 Conference in New Orleans, LA, USA."
  },
  {
    "date": "2019-10",
    "title": "position",
    "description": "I am happy to start a research internship at the International Laboratory on Learning Systems (ILLS) in partnership with McGill University, ÉTS Montreal, Mila – Quebec AI Institute, CNRS and Université Paris-Saclay."
  },
  {
    "date": "2022-04",
    "title": "talk",
    "description": "Gave a talk at a poster session of the ICLR 2022 Conference."
  },
  {
    "date": "2022-04",
    "title": "paper",
    "description": "I will be attending ICLR 2022 Conference virtually."
  },
  {
    "date": "2022-01",
    "title": "paper",
    "description": "Our work entitled “IGEOOD: An Information Geometry Approach to Out-of-Distribution Detection” has been accepted to appear in the ICLR 2022 Conference."
  },
  {
    "date": "2021-10",
    "title": "paper",
    "description": "Our short version work entitled “IGEOOD: An Information Geometry Approach to Out-of-Distribution Detection” has been accepted to appear in the NeurIPS 2021 DistShift Workshop."
  },
  {
    "date": "2021-08",
    "title": "paper",
    "description": "Our work entitled “CSI-Aided Robust Neural-Based Decoders” has been accepted to appear in the 11th International Symposium on Topics in Coding (ISTC)."
  },
  {
    "date": "2021-05",
    "title": "service",
    "description": "Will service as a reviewer for the NeurIPS 2021 Conference."
  },
  {
    "date": "2020-12",
    "title": "teaching",
    "description": "I will be a teaching assistant at the course “Introduction to Deep Learning” at CentraleSupélec."
  },
  {
    "date": "2020-10",
    "title": "phd",
    "description": "I am excited to start my PhD in Machine Learning at CentraleSupélec."
  }
]
